In [1]:
import pandas as pd

data = {
    'id' : [1,2,3],
    'name' : ['Choi', 'Lee', 'Kim'],
    'age' : [10,20,30],
    'assets' : [150.4, 123.4, 88.88],
    'job' : ['student', 'CEO', 'Dad']
}

df = pd.DataFrame(data)
df

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [9]:
df.sort_index(axis=0, ascending=True)

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [14]:
df.sort_values(by=['job','age'], ascending=False)

   id  name  age  assets      job
0   1  Choi   10  150.40  student
2   3   Kim   30   88.88      Dad
1   2   Lee   20  123.40      CEO

## 05 데이터 정렬 - 연습문제

1. 구구단 9단의 시리즈 se2를 생성하되, 인덱스를 거꾸로 생성하라.

In [4]:
import pandas as pd
se1 = pd.Series(range(1,10))
se9 = se1*9
se9.index = list(range(1,10))[::-1]
se9

9     9
8    18
7    27
6    36
5    45
4    54
3    63
2    72
1    81
dtype: int64

2. 구구단을 거꾸로 출력하라.

In [5]:
se9.sort_index()

1    81
2    72
3    63
4    54
5    45
6    36
7    27
8    18
9     9
dtype: int64

3. 구구단 7단과 8단을 만들어 df2에 추가하라.

In [6]:
se7 = se1 * 7
se8 = se1 * 8
dict1 = {"7단": se1, 
         "8단": se8,
         "9단": se9}

df2 = pd.DataFrame(dict1)
df2

    7단    8단    9단
0  1.0   8.0   NaN
1  2.0  16.0  81.0
2  3.0  24.0  72.0
3  4.0  32.0  63.0
4  5.0  40.0  54.0
5  6.0  48.0  45.0
6  7.0  56.0  36.0
7  8.0  64.0  27.0
8  9.0  72.0  18.0
9  NaN   NaN   9.0

4. df2의 컬럼을 오름차순으로 정렬하라.

In [8]:
df2.sort_index(axis=1, ascending=False)

     9단    8단   7단
0   NaN   8.0  1.0
1  81.0  16.0  2.0
2  72.0  24.0  3.0
3  63.0  32.0  4.0
4  54.0  40.0  5.0
5  45.0  48.0  6.0
6  36.0  56.0  7.0
7  27.0  64.0  8.0
8  18.0  72.0  9.0
9   9.0   NaN  NaN